IDENTIFICATION DIVISION.
PROGRAM-ID. CICS.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MAP.
   05 WS-FIRST-NAME PIC X(20).
   05 WS-SURNAME PIC X(20).
   05 WS-MIDDLE-NAME PIC X(20).
   05 WS-DOB PIC X(20).
   05 WS-COMPUTED-AGE PIC X(20).
   05 WS-SCHOOL-LEVEL PIC X(20).
   05 WS-MODE-OF-PAYMENT PIC X(20).
   
PROCEDURE DIVISION.
    EXEC CICS RECEIVE MAP('MAPNAME') MAPSET('MAPSETNAME') INTO(WS-MAP) END-EXEC.
