IDENTIFICATION DIVISION.
PROGRAM-ID. SortProgram.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE ASSIGN TO 'input.txt'.
    SELECT SORTFILE ASSIGN TO 'sorted.txt'.
DATA DIVISION.
FILE SECTION.
FD INFILE.
01 IN-REC PIC X(100).
SD SORTFILE.
01 OUT-REC.
   02 FILLER PIC X(9).
   02 KEY-FIELD PIC X(10).
   02 FILLER PIC X(81).
PROCEDURE DIVISION.
BEGIN.
    OPEN INPUT INFILE.
    SORT SORTFILE ON ASCENDING KEY KEY-FIELD
        INPUT PROCEDURE IS READ-INFILE
        OUTPUT PROCEDURE IS WRITE-OUTFILE.
    STOP RUN.
READ-INFILE.
    READ INFILE AT END SET END-OF-FILE TO TRUE.
        RELEASE IN-REC.
WRITE-OUTFILE.
    WRITE OUT-REC FROM SORTFILE.
